[Language]
Code="uz-Cyrl-UZ"
Name="Ўзбекча"
Version="2.6.3"
Translator="Orzu Samarqandiy <orzu@users.sourceforge.net>"
Dir="ltr"

[MainFrame]
Title="Lingoes"
Close="Ёпиш"
Maximize="Максималлаштириш"
Minimize="Минималлаштириш"
Restore="Тиклаш"
Menu="Асосий Меню"

; Status Icon
[NotifyIcon]
Tip="Lingoes таржимон\nКурсор ости таржимаси: [$CursorStatus]\nБелгиланган матн таржимаси: [$SelectionStatus]\nБуфердаги матн таржимаси: [$ClipboardStatus]"
InfoTitle="Lingoes таржимон"
Info="Курсор ости таржимаси: [$CursorStatus]\nБелгиланган матн таржимаси: [$SelectionStatus]\nБуфердаги матн таржимаси: [$ClipboardStatus]"
Enabled="Ёқилган"
Disabled="Ўчирилган"

[MainMenu]
Open="Очиш"
CursorTranslator="Курсор ости таржимаси"
SelectionTranslator="Белгиланган матн таржимаси"
ClipboardTranslator="Буфердаги матн таржимаси"
Configuration="Созлашлар..."
Dictionaries="Луғатлар..."
Appendices="Иловалар..."
Activation="Дастур активацияси"
UpdateOnline="Онлайн янгилаш"
Help="Ёрдам"
About="Lingoes ҳақида"
SupportOnline="Онлайн қўллаб-қувватлаш"
Exit="Чиқиш"
EnterLicense="Лицензияни киритиш..."

[DlgInput]
Back="Орқага"
Forward="Олдинга"
MainMenu="Асосий Меню"
HistoryList="Фойдаланиш тарихи"
Search="Қидириш", "Батафсил шарҳни қидириш"
WebSearch="Интернетда қидириш"
AutoMatch="Автомослаштириш", "Индекс гуруҳига автомослаштириш"
MatchSetup="Индекс гуруҳи танловлари..."
FindEngine="Веб-механизмлар ўрнатиш..."

[DlgIndex]
Index="Индекс"
Guide="Қўлланма"
Appendix="Илова"
NoIndex="Индекссиз"
AddIndexGroup="<div style=\"margin: 10; font-family: '[$TextFont]'; font-size: [$TextFontSize]pt\">Луғат ҳақида маълумот қўшиш <b>Индекс гуруҳи</b>, Сўзни киритаётгн пайтда маслаҳат олишингиз мумкин.<br/><br/><a href=\"app://dictionary_group/[$IndexGroupID]\"><u>Индекс гуруҳларни бошқариш учун бу ерга босинг.</u></a></div>"

[WebGuide]
Results="Натижалар"
Spelling="Талаффуз вариантлари"
Appendices="Иловалар"
Options="Танловлар"
Dictionaries="Луғатлар...", "Луғатларни бошқариш"
ManageAppendices="Иловалар...", "Иловаларни бошқариш"
Configuration="Созлаш...", "Созлаш ойнасини очиш"
Help="Ёрдам", "Lingoes ҳақида ёрдам ойнасини очиш"
Homepage="lingoes.net", "Lingoes веб-сайтини очиш"
Community="Lingoes Жамияти", "Онлайн Lingoes Жамияти"

[DlgAppendix]
WndTitle="Иловалар танловлари"
Close="Ёпиш"
Install="Ўрнатиш", "Lingoes Иловалари (*.laf)|*.laf|", "Ўрнатиб бўлмади! \nБалки сиз етарли ҳуқуқга эга эмассиз."
Delete="Ўчириш", "\"[$Title]\"ни ҳақиқатда ўчирмоқчимисиз", "\"[$Title]\"ни ўчириб бўлмади! \nБалки сиз етарли ҳуқуқга эга эмассиз."
Modify="Ўзгартириш", "Ўзгартириб бўлмади! \nБалки сиз етарли ҳуқуқга эга эмассиз."
NewGroup="Янги гуруҳ тузиш", "Янги гуруҳ тузиб бўлмади! \nБалки сиз етарли ҳуқуқга эга эмассиз."
MoveUp="Юқорига"
MoveDown="Пастга"
CreateAppendix="Илова тузиш..."
Download="Кўпроқ илова олиш..."
Name="Номи"
Group="Гуруҳи"
InstallSucceed="\"[$Title]\" муваффақиятли ўрнатилди."
OverwriteInstall="Илова мавжуд, устидан ёзмоқчимисиз?\n\nСарлавҳаси:[$Title]\nНоми: [$Name]"
InvalidInstallFile="Нотўғри ўрнатиш файли!\n[$Filename]"

[DlgAppendixEdit]
WndTitle="\"[$Title]\"ни ўзгартириш", "Янги гуруҳ тузиш"
Name="Номи"
DisplayTitle="Сарлавҳаси"
DisplayStyle="Услуби"
Ok="Маъқул"
Cancel="Керак эмас"

[DlgAppendixBuilder]
WndTitle="Илова тузувчи"
Name="Номи:  (Фақат a-z, 0-9, дефис ва пастки чизиқ)", "Ном албатта керак, фақат a-z, 0-9, дефис ва пастки чизиқ мумкин."
Title="Сарлавҳа:", "Сарлавҳа албатта керак!"
Location="Лойиҳа папкаси жойи:", "Лойиҳага папка тузиб бўлмади!", "Мавжуд папкани танланг"
Create="Янги лойиҳа тузиш", "Янги лойиҳа муваффақиятли тузилди!\n\nЭнди сиз \"index.html\" файлини таҳрирлаб, иловани таъбингизга мослаштиришингиз мумкин.", "Янги лойиҳа тузиб бўлмади!"
Build="Тузиш", "Илова файли муваффақиятли тузилди!\n[$Filename]", "Илова файли тузиб бўлмади!\n[$Filename]"
Close="Ёпиш"
Tips="Маслаҳат: Янги лойиҳа тузилгандан кейин, сиз \"index.html\" файлини таҳрирлаб, иловани таъбингизга мослаштиришингиз мумкин."
OverwriteProject="Лойҳа файли мавжуд, устидан ёзилади."

[DlgStatus]
KeepVisible="Доим бошқа ойналар устида бўлиш"
CursorTranslator=""
SelectionTranslator=""
ClipboardTranslator=""
OpenMiniWnd="Мини ойнани Очиш/Ёпиш"

[DlgView]
Speak="Талаффуз", "Белгиланган матнни талаффуз қилиш"
Search="Қидириш"
Copy="Нусха олиш"
Print="Чоп этиш..."
Save="Сақлаш..."
Find="Топиш..."
SelectAll="Ҳаммасини белгилаш"
TextTranslate="Матн таржимаси", "Матн таржимасини ишга тушириш"
StartPage="Бош саҳифа", "Бош саҳифа"
ShowIndex="Ён полосани кўрсатиш"
HideIndex="Ён полосани яшириш"
SaveFilter="HTML файл (*.htm; *.html)|*.htm;*.html|"
SpeechOption="Нутқ танлови..."
SelectVoice="Овозни танлаш"
Activation="Активация", "Lingoes активацияси бўйича ёрдам"
Buy="Сотиб олиш", "Lingoes дастурининг тижорат лицензиясини сотиб олиш"

[DlgRegister]
Title="Lingoes - Тижорат фойдаланувчиси регистрацияси"
FreeDownload="Lingoes фақат нотижорат фойдаланувчилар учун бепул.\r\nУни бу ердан юклаб олиш мумкин..."
Name="Регистратор номи:", "Регистратор номи бўлиши шарт"
Email="Электрон почтаси:", "Электтрон почта бўлиши шарт"
RegCode="Регистрация коди:", "Регистрация коди нотўғри"
Support="Мижозлар хизмати"
Register="Регистрация қилиш", "Регистрация маълумотларини сақлаб бўлмади"
Exit="Чиқиш"

[DlgInfo]
Title="Хабар"
Ok="Маъқул"
Cancel="Керак эмас"
Yes="Ҳа"
No="Йўқ"
Retry="Яна ҳаракат қилиш"
Abort="Тўхтатиш"
Ignore="Эътибор бермаслик"

[DlgAuthentication]
Title="Уланиш "
TitleProxy="Уланиш прокси сервери "
Username="Фойдаланувчи:"
Password="Сирли сўз:"
Remember="Сирли сўзни эслаб қолиш"
Ok="Маъқул"
Cancel="Керак эмас"

[WndGrab]
Open="Батафсил шарҳни қидириш"
Speak="Талаффуз қилиш"
Copy="Нусха олиш"
TextTranslation="Матн таржимаси"
Back="Орқага" 
Forward="Олдинга"
Search="Қидириш\n  Enter:\t\tҚидириш\n  Ctrl + Enter:\tБатафсил шарҳни қидириш\n  Shift + Enter:\tМатн таржимаси\n  Alt + Enter:\tИнтернетда қидириш"
RollUp="Ойнани Ўраш/Тиклаш"
Option="Танлов"
KeepVisible="Доим бошқа ойналар устида бўлиш"
KeepSize="Ойна ўлчамини эслаб қолиш"
AutoRollUp="Автоматик ўраш", "Йўқ", "[$DelaySecond] секунддан кейин"
CloseMiniWnd="Мини ойнани ёпиш"

[DlgDictOption]
Title="Луғатларни созлаш"
NetInstall="Lingoes сайтидан юклаб олиш", "Lingoes сайтидан юклаб олиш"
Install="Ўрнатиш", "Локал дискдаги луғатни ўрнатиш"
Uninstall="Ўчириш", "Мавжуд луғатни ўчириш"
Add="Қўшиш", "Луғатни рўйхатга қўшиш"
Remove="Олиб талшлаш", "Луғатни рўйхатдан олиб ташлаш"
Download="Юклаб олиш", "Луғатни офлайн ишлатиш учун юклаб олиш"
MoveTop="", "Энг тепага"
MoveUp="", "Юқорига"
MoveDown="", "Пастга"
MoveBottom="", "Энг қуйига"
MoreDetails="", "Луғат ҳақида батафсил маълумот"
Close="Ёпиш"

Installed="Ўрнатилган луғатлар"
Query="Ўрнатилган луғатлар"
Index="Индекс гуруҳи"
Grab="Курсор остидаги матн гуруҳи"

InstalledList="Ўрнатилган луғатлар рўйхати"
QueryList="Ўрнатилган луғатлар рўйхати"
IndexList="Индекс гуруҳи рўйхати"
GrabList="Курсор остидаги матн гуруҳи рўйхати"
DictID="ID"
Online="Онлайн"

Type="Тури"
OnlineType="Интернетга уланиш шарт"
NotLicensed="(Лицензияланмаган <a href='app://activate/'><u>Активация</u></a> <a href='app://buy/[$ProductID]'><u>Сотиб олиш</u></a>)"

AddFilter="Lingoes луғатлари (*.ld2, *.ldp)|*.ld2;*.ldp|"
InstallDict="Луғатни ўрнатиш"
Installing="Ўрнатилмоқда..."
IndexDictTooMany="Маслаҳат:\n\n\"Индекс гуруҳи\"га кўп луғатларни қўшиш қидириш майдонига киритилаётган сўзни мослаштириш суръатини пасайтиради.\n\nШунинг учун, \"Индекс гуруҳи\"га фақатгина тез-тез ишлатиладиган бир неча луғатларни қўшишни тавсия этамиз.."

[DlgDictList]
Title="Луғатларни қўшиш"
Add="Қўшиш"
Cancel="Керак эмас"
Select="Танлаш"
DictList="Ўрнатилган луғатлар"
ID="ID"
Online="Онлайн"

[DlgDictInfo]
Title="Луғат ҳақида батафсил маълумот"
Close="Маъқул"

ID="ID"
MD5="MD5"
Tag="Тэглар"
Name="Номи"
Version="Версияси"
Date="Тузилган санаси"
Update="Янгиланган санаси"
IndexCount="Жами сўзлар сони"
Language="Тил"
MoreLanguage="Кўпроқ..."
DictTitle="Луғат номи"
DictEdition="Нашри"
DictDescription="Луғат ҳақида"
PubAuthor="Муаллиф"
PubPress="Нашриёт"
PubEmail="Электрон почта"
PubWebsite="Интернет сайт"
PubCopyright="Муаллифлик ҳуқуқи"
Filename="Файл номи"

; Install Dictionaries
[DlgDictInstall]
Title="Луғат ўрнатиш"
InstallSucceed="\"[$DictTitle]\" муваффақиятли ўрнатилди"
DictGroupOption="Танловлар"
AddIndexGroup="\"Индекс гуруҳи\"га қўшиш"
AddIndexGroupDesc="Lingoes индекс гуруҳидаги луғатларни излайди ва киритилаётган сўзга энг яқин бўлган луғат мақоласини белгилайди."
AddGrabGroup="\"Курсор остидаги матн гуруҳи\"га қўшиш"
AddGrabGroupDesc="Lingoes экрандаги матн гуруҳидаги луғатларни иизлайди ва курсор турган жойдаги матн таржимаси натижасини кўрсатади."
Ok="Маъқул"

; Configuration
[DlgOption]
Title="Созлаш"
Ok="Маъқул"
Cancel="Керак эмас"
General="Умумий"
Appearance="Кўриниш"
Connection="Уланиш"
Speech="Нутқ"
Hotkey="Тезкор тугмалар"
Translate="Таржима"
License="Лицензиялар"
Capture="Курсор остидаги матн"

; General
[DlgOptGeneral]
Language="Тил"
UILanguage="Фойдаланувчи интерфейси тили"

WebSearch="Интернетда қидириш"
SelectWebSearch="Интернетда қидириш вақтида ишлатиладиган механизмни танланг"

TermHistory="Тарих ва Кэш"
SaveHistory="Эслаб қолинадиган қидирилган сўзлар сони"
ClearHistory="Тарихни тозалаш"
ClearHistoryConfirmation="Ҳақиқатда тарихни тозаламоқчимисиз?"

ResultCache="Онлайн луғатнинг локал кэши"
ClearCache="Кэшни тозалаш", "Ҳақиқатда кэшни тозаламоқчимисиз?"

AutoStart="Windows юклангандан Lingoes дастурини ишга тушириш"
StartMin="Ишга туширилгандан минималлаштириш"

; Appearance
[DlgOptAppearance]
UserInterface="Фойдаланувчи интерфейси"
WindowStyle="Ойна тури"
WindowFont="Ойнадаги матн шрифти"
WindowFontSize="Шрифт ўлчами"
WindowFontSizeList="7", "8", "9", "10", "10.5", "11"
ResultDisplay="Натижаларни кўрсатиш"
TextFont="Матн шрифти"
TextFontSize="Шрифт ўлчами"
TextFontSizeList="7", "8", "9", "10", "10.5", "11", "12", "13", "14", "16", "18", "20", "22", "24", "26", "28", "32", "36", "48"
PhoneticFont="Фонетик шрифт"
CursorTranslatorBar="Курсор остидаги матн ойнаси"
FontColor="Шрифт ранги"
BackColor="Орқа фон ранги"
BorderColor="Чегара ранги"
Transparence="Шаффоф экрандаги матн ойнаси"
SampleText="Намунавий матн"

[Style]
0="Ҳеч қанақа"
1="Асл услуб"

; Translate
[DlgOptTranslate]
SupportLCMap="Локал тилни қўллаб-қувватлаш"
InstantTranslation="Лаҳзали таржима"
TargetLanguage="Таржима кўрсатиладиган тил:"
CurrentUserLanguage="= Жорий фойдаланувчи тили"
TargetLanguage2="Агар икки тил бир хил бўлса, таржима кўрсатиладиган тил:"
NoTranslate="= Таржма қилмаслик"

; Capture
[DlgOptCapture]
CursorActivation="Курсор остидаги сўзни ушлаб олиш"
MouseActivation="Сичқончани фаоллаштириш режими:"
MouseOver="Устига сичқонча курсори"
LeftMouseButton="Сичқонча чап тугмаси"
MiddleMouseButton="Сичқонча ўрта тугмаси"
RightMouseButton="Сичқонча ўнг тугмаси"
MouseXButton1="Сичқонча X Тугма1"
MouseXButton2="Сичқонча X Тугма2"
TimeDelay="Кўрсатиш давомийлиги:"
MSEL="миллисекунд"
MatchPhrase="Жумлага мослаштириш"
IgnoreNumber="Рақамларга эътибор бермаслик"
IgnoreLatin="Лотин ҳарфларига эътибор бермаслик (Инглиз, Француз, Немис, ҳкз.)"
IgnoreCJK="Шарқий Осиё тилларига эътибор бермаслик (Хитой, Япон, Корейс, ҳкз)"
IgnoreCyrillic="Кирилл ҳарфларига эътибор бермаслик (Рус, Ўзбек, Тожик, ҳкз.)"
IgnoreArabic="Араб ва Яҳудий ҳарфларга эътибор бермаслик"
InstallAdobePlugin="Adobe Acrobat PDF қўшимчасини ўрнатиш"
ZonedWord="Белгиланган матнни таржима қилиш"
ForTextSelection="Белгиланган матн учун"
ForDoubleClicking="Сичқонча тугмасини икки марта босиш учун"
ZonedWordFilterRule="Матн белгилаш фильтри қоидалари..."
ShowOnlyFirstResult="Қидиришнинг фақат биринчи натижасини кўрсатиш"

; Capture - Text Selection Filter
[DlgOptTranslateZWFilter]
Title="Матн белгилаш фильтри қоидалари"
ProgramFilename="Дастур файли номи", "Дастур файли номи (Бўш бўлса, барча дастурлар)"
WndClassName="Ойна синфи номи", "Ойна синфи номи (Бўш бўлса, барча ойна синфлари)"
DisableSelect="Матн белгилашга эътибор бермаслик", "Матн белгилашга эътибор бермаслик"
DisableDBLClick="Сичқонча тугмаси икки босилганига эътибор бермаслик", "Сичқонча тугмаси икки босилганига эътибор бермаслик"
Comment="Изоҳ", "Изоҳ"
Add="Қўшиш"
Modify="Ўзгартириш"
Delete="Ўчириш", "Ҳақиқатда ўчирмоқчимисиз?"
Ok="Маъқул"
Cancel="Керак эмас"
LoadDefault="Аслини юклаш", "Ҳақиқатда асл ҳолатини юкламоқчимисиз?"
Browser="...", "Браузер", "Дастур (*.exe)|*.exe|"
Capture="...", "Ойна синфи номини аниқлаш"
AllProgram="-- Барча дастурлар --"
AllWindow="-- Барча ойна синфлари --"

[WndClassNameCapture]
Title="Ойна синфи номини аниқлаш"
ProgramFilename="Дастур файли номи"
WndClassName="Ойна синфи номи"
Capture="Экрандан аниқлаб олиш"

; Speech
[DlgOptSpeech]
RPPEngine="Овоз механизми"
RPPEnable="Ёқилган"
RPPVoice="Овоз"
RPPRebuildIndexFile="Индексни қайта тузиш", "Индекс файлини қайта тузиб бўлмади! \nБалки сиз етарли ҳуқуқга эга эмассиз."
Engine="Матндан-Овозга механизми"
Voice="Овоз"
Enable="Ёқилган"
Volume="Баландлик"
Pitch="Тон"
Speed="Тезлик"
Format="Формат", "Асл формат", "Қуйидаги формат қўллаб-қувватланмайди: [$Format]"
RealtimePron="Реал вақтдаги талаффуз"
PronInQuery="Сўз қидирилаётган вақтда"
PronInCapture="Курсор остидаги сўз ушлаб олинганда"
PronInSelect="Белгиланган матн таржима қилинаётганда"
Test="Синаш"
EnterText="Матнни киритиб, овозни синаб кўринг"
DownloadTTS="Natural Voice && TTS Engine овоз пакетини юклаб олиш..."

; Connect
[DlgOptConnection]
ConnectSet="Уланишни созлаш"
DirectConnect="Тўғридан-тўғри уланиш"
IEProxyConnect="Браузердаги прокси сервер созланишларидан фойдаланиш"
ProxyConnect="Прокси-сервер / Фаервол орқали уланиш"
ProxyServer="Прокси-сервер:"
ProxyPort="Порт:"
Username="Фойдаланувчи:"
Password="Сирли сўз:"
OnlineUpdate="Онлайн янгилаш"
UpdateNow="Ҳозироқ янгилаш"
EnableUpdate="Онлайн янгилашни ёқиш"

; Hotkey
[DlgOptHotkey]
OpenMainWnd="Бош ойнани Очиш/Ёпиш"
GrabToggleKey="Курсор остидаги сўзни ушлашни ёқиш"
SelectionToggleKey="Белгиланган матн таржимасини ёқиш"
ClipboardToggleKey="Буфердаги матн таржимасини ёқиш"
Pronounce="Талаффуз қилиш"
CopyInterpretation="Таржима матнидан нусха олиш"
SpeakSelectedText="Белгиланган матнни талаффуз қилиш"
StopSpeak="Талаффуз қилишни тўхтатиш"
DisableHotKey="Тезкор тугмаларни бекор қилиш"
OpenMiniWnd="Мини ойнани Очиш/Ёпиш"
RollUpMiniWnd="Мини ойнани Ўраш/Тиклаш"

[DlgExpire]
Title="Синаш муддати тугади"
Ok="Ҳозироқ янгилаш"
Cancel="Чиқиш"
NetworkSettings="Тармоқ созлашлари"
Support="Lingoes.net"
AskUpgrade="Дастурнинг синов муддати тугади. Уни ишлатиш учун, янги версияга янгилашингиз керак! \nЯнгилаймизми?"

[DlgAbout]
DlgTitle="Lingoes дастури ҳақида"
PortableEdition="Портатив версия"
Email="Электрон почта"
Website="Дастур сайти"
LicenseTo="Ушбу дастур лицензияланган шахс:"
PersonalUser="Шахсий нотижорат фойдаланувчи"
EvaluationUser="Ушбу синов дастури фақат баҳо бериш учун мўлжалланган"
UserLicenseQuantity="[$Quantity] лицензия", "[$Quantity] лицензия ([$KeyNo]/[$Quantity])"
LicenseExpire="Лицензия [$Day] кундан сўнг тугайди"

[WebResult]
SpellingAlternatives="Муқобил талаффуз"
SpellChecker="Имлони текшириш"
TextTranslation="Матн таржимаси"
WebSearch="Интернет қидируви"
MoreResults="Кўпроқ натижалар"
WaitSearch="Қидирув натижалари кутилмоқда..."
NoMatch="<div id='dict_result_nomatch' style=\"font-family:'[$TextFont]'; font-size:[$TextFontSize]pt; line-height:normal; padding:10; display:[$Display]\"><b>\"<font color='#C00000'>[$SearchKey]</font>\" учун таржима топилмади.</b></div>"

[WebStartPage]
StartPageTpl="<table id='startpage' width='100%' height='100%' border='0' cellspacing='0' cellpadding='10' onselectstart='return false'><tr><td align='center' style=\"font-family: '[$Font]'; font-size: [$FontSize]pt; line-height: 1.2em\"><a href='app://homepage/'><img border='0' src='[$ImgPath]logomain.png' width='134' height='40' style='margin-bottom:50'></a></td></tr></table>"
HelpTip="Дастурни қандай ишлатиш керак"
DownDictTip="Кўпроқ луғатларни юклаб олинг"
Intro="80 дан ортиқ тиллардан бир-бирига таржима қила олади<br>Курсор остидаги сўз таржимаси, Матн таржимаси ва Матнни талаффуз қилиш"

[TextTranslation]
Title="Матн таржимаси"
To="га"
Translate="Таржима"
RequestFailed="Таржима хизматига жавоб бермади."
ConnectFailed="Lingoes серверга улана олмади. Агар сиз интернетга уланган бўлсангиз, конфигурациядан уланиш созлашларини текшириб кўринг."
WaitRequest="Қидирув натижали кутилмоқда..."
ParseResultFailed="Таржма таҳлили натижа бермади. Агар сиз ушбу хабарни бир неча марта олсангиз, бизга хабар беринг."

; Layout
[Layout]
DictMenu="Луғат менюси"
ShowResult="Натижаларни кўрсатиш"
MinimizeResult="Натижаларни минималлаштириш"
FindWord="Топиш: "
NoLicenseTip="Таржиманинг тўла шакли лицензия олингандан сўнг кўрсатилади...", "Луғатнинг синов версияси фақат баҳолаш мақсадлари учун мўлжалланган, таржиманинг тўла шакли лицензия олингандан сўнг кўрсатилади: &nbsp;<a href='app://activate/'><u>Активация</u></a> &nbsp<a href='app://buy/[$ProductID]'><u>Сотиб олиш</u></a>", "Ушбу версия - синов версияси бўлиб, у фақат баҳолаш мақсадлари учун мўлжалланган, лицензия олингандан сўнг барча функциялар фаоллаштирилади: &nbsp;<a href='app://activate/'><u>Активация</u></a> &nbsp<a href='app://buy/[$AppProductID]'><u>Сотиб олиш</u></a>"

; Dictionary Menu
[DictMenu]
About="Луғат ҳақида..."
Enable="Ёқиш"
Disable="Ўчириш"
DisableMsg="Луғат ўчирилган ва натижаларни кўрсатмайди!\nУни \"Луғатлар\" диалог ойнасида ёқишингиз мумкин."
MoveTop="Юқорига силжитиш"
ArrangeResults="Натижаларни тартиблаш..."
IndexGroup="  (Index Group)"
QueryGroup="  (Query Group)"
GrabGroup="  (Text Capture Group)"

[Update]
Title="Онлайн янгилаш"
AskUpgrade="Янги версия мавжуд. Дастурни янгиламоқчимисиз?"
UpgradeNow="Янги версия мавжуд. Дастурни янгилаш зарур."
UpdateSuccess="Дастур муваффақиятли янгиланди!"
UpdateFail="Янгилаб бўлмади!"
NoUpdate="Жорий версия охирги саналади"

CheckUpdate="Checking update..."
GetUpdateInfo="Getting updated information..."
DownUpdateData="Downloading updated data..."
ExecUpdate="Updating system..."
GetUpgradeInfo="Getting upgraded information..."
DownUpgradeData="Downloading upgraded data..."
ExecUpgrade="Upgrading system..."
NeedExitForUpgrade="Lingoes will quit for finishing upgrade"

[Message]
InitUpdateServerFail="Автоматик янгилаш хизматини ишга тушириб бўлмади."
StartDictServerFail="Луғатлар хизматини ишга тушириб бўлмади."

DictFileErr="Файл формати нотўғри!\n[$Filename]"
DictVersinTooOld="[$Filename]\nЛуғатнинг ([$DictVer]) версияси жуда эски, уни янгилаш зарур..\n\nДастур сайтидан луғатнинг янги версиясини қидирамизми?"
DictVersinTooNew="[$Filename]\nЛуғатнинг ([$DictVer]) версияси дастурнинг янги версиясини талаб этади.\n\nДастур сайтидан дастурнинг янги версиясини юклаймизми?"

AskDictRepeatInstall="Луғатлар рўйхатида \"[$DictTitle]\" луғати ҳам бор,\nДавом этаверамизми?"
InstallDictFail="Луғатни ўрнатиб бўлмади:\n[$Filename]"
AskUninstall="Ҳақиқатдан ҳам қуйидаги луғатни ўчирмоқчимисиз?\n\n[$DictTitle]\nID: [$DictID]"
UninstallDictFail="[$DictTitle] луғатини ўчириб бўлмади\nID: [$DictID]"
AskRemoveFromGroup="Ҳақиқатдан ҳам \"[$DictTitle]\" луғатини рўйхатдан ўчирмоқчимисиз?"

MemoryAllocFail="Хотирага мурожаат этиб бўлмади."
FilenameInvalid="Нотўғри файл номи."
SaveFileFail="Файлни сақлаб бўлмади"
OpenFileFail="Файлни очиб бўлмади"

AreYouAbort="Ҳақиқатдан ҳам жараённи тўхтатмоқчимисиз?"
CreateThreadFail="Ришта тузиб бўлмади"
CreateEventFail="Ҳодиса тузиб бўлмади"
Unfulfilment="Бу функция ишлаб чиқилмаган"
OnlyProVersion="Бу функция фақат ПРО версияда мавжуд."
NoRegister="Бу регистрация қилинмаган версия, ушбу функцияни ишлатиш учун дастурни регистрация қилиш."
UsernameIsEmpty="Фойдаланувчи формаси бўш, илтимос, қайта тўлдиринг."
SaveSearchResultFail="Қидирув натижасини сақлаб бўлмади." механизм

OpenAppendixFail="Иловани очиб бўлмади.\n\nУни дастур сайтидан юклаб оламизми?"
OpenSpeechEngineFail="Матндан-Овозга механизмини юклаб бўлмади, илтимос, унинг ўрнатилганлигини текшириб кўринг! \n\nТалаффуз қилиш учун операцион тизимда Матндан-Овозга механизми ўрнатилган бўлиши керак. Бўлмаса, уни дастур сайтидан юклаб олиб ўрнатишингиз мумкин. \n\nЮклаб оламизми?"

; NeedIE6Support="Дастур ишлаши учун Internet Explorer 6+ керак, илтимос, брузерингизни янгиланг"
NoImplement="Кечирасиз, ушбу функция ишлаб чиқилмаган"

InstallSucceed="Муваффақиятли ўрнатилди." 
InstallFailed="Ўрнатиб бўлмади."

[DlgOptLicense]
Product="Дастур лицензияси"
Enter="Лицензияни киритиш..."
Remove="Лицензияни ўчириш", "Лицензияни ўчириш дастурнинг баъзи функцияларининг ишламаслигига олиб келиши мумкин.\nҲақиқатдан ҳам қуйидаги маҳсулотлар учун лицензияни ўчирмоқчимисиз:\n\n[$ProductList]"
Detail="Батафсил..."

LicenseID="Лицензия рақами: "
LicenseTo="Лицензия эгаси: "
LicenseExpire="лицензия [$Day] кундан кейин тугайди"
UserLicenseQuantity="[$Quantity] лицензия", "[$Quantity] лицензия ([$KeyNo]/[$Quantity])"

[DlgActivation]
Title="Лицензияни киритинг"
ActivateTitle="Лицензия калитини киритинг", "Лицензия калити сотиб олинганликни тасдиқловчи электрон почта хабарида ёки ўрнатишш диски футлярининг ички томонида ёзилган бўлади."
LicenseKey="Лицензия калити:"
Name="Фойдаланувчи:"
Email="Электрон почта:"
NetworkSet="Тармоқ созланишлари", "Лицензияни активация қилиш учун онлайн бўлиингиз шарт. Илтимос, агар лозим бўлса, прокси-серверни созланг."
Activate="Активация"
BuyTitle="[$Publisher] маҳсулотини сотиб олиш", "[$Publisher] маҳсулотини сотиб олиш учун, "Сотиб олиш" тугмасига босинг."
Buy="Сотиб олиш"
Cancel="Ёпиш"

IncorrectProductKey="Нотўғри лицензия калити."
IncorrectName="Нотўғри фойдаланувчи. Кўпи билан 32 ҳарфдан иборат бўлиши керак"
IncorrectEmail="Нотўғри электрон почта. Кўпи билан 128 ҳарфдан иборат электрон почта киритинг."
WaitRequest="Қайта ишланмоқда... Илтимос, сабр қилинг."

RequestFailed="Активация қилиб бўлмади. Сервер банд бўлса керак. Илтимос, кейинроқ ҳаракат қилиб кўринг."
NetworkFault="Активация серверига уланиб бўлмади, илтимос, тармоқ созланишларини текширинг."
ResponseError="Сервер нотўғри жавоб берди."
OtherError="Номаълум хатолик."
SaveDataFailed="Маълумотни сақлаб бўлмади"

ActivateSuccess="Активация муваффақиятли бажарилди"
ActivateFailed="Активация қилиб бўлмади"
